{
    "headline": "My Redline '25 Redemption Plan: From Data Debrief to Race Day Strategy (Part 1)",
    "text": "<section>\r\n<p>Last year, I dove deep into my '24 Redline Fitness Games performance in a blog post titled <a href=\"/blog/my-redline-24-journey-sweat-stats-and-a-strategy-for-25\">\"My Redline '24 Journey: Sweat, Stats, and a Strategy for '25\"</a>. The data told a humbling story, best captured by the chart below. It compares my station times against competitors who finished within +/- 5% of my overall time, and the message was crystal clear: I got absolutely smoked on the Deadball Burpees, and my pacing fell apart as the race went on.</p>\r\n<figure class=\"figure text-center my-4\">\r\n<img src=\"/blog/image/my-redline-25-redemption-plan-from-data-debrief-to-race-day-strategy-part-1/thumb_Figure1.png\" class=\"figure-img img-fluid rounded\" alt=\"My 2024 Station Time Difference vs. Similar Finishers\">\r\n<figcaption class=\"figure-caption text-center\">Figure 1: My '24 performance breakdown. The red bars show where I lost time against my peers, highlighting a clear downward trend.</figcaption>\r\n</figure>\r\n<p>Armed with this brutal but necessary feedback, I built a multi-faceted plan to turn my weaknesses into strengths for Redline '25. This wasn't just about training harder; it was about training smarter.</p>\r\n</section>\r\n<section>\r\n<h4>Step 1: Get Hands-On with The Equipment</h4>\r\n<p>My first key takeaway was embarrassingly simple: I needed to actually practice with the race day equipment. Normally I do a regular bodyweight/dumbells bootcamp (<a href=\"https://www.instagram.com/cosmicfitclubmy\" target=\"_blank\" rel=\"noopener noreferrer\">@cosmicfitclubmy</a>) and dumbells at home. Until the beginning of June, I hadn't touched an Erg, Sandbag, Sled, Kettlebell, or Deadball specific to Redline. To fix this, I signed up for a series of prep classes with Coach Dennis Oh (<a href=\"https://www.instagram.com/dennisohwk\" target=\"_blank\" rel=\"noopener noreferrer\">@dennisohwk</a>), a fellow numbers nerd who understands the technical nuances of each station. Those six sessions were invaluable. We ran a full simulation (with reduced running), which painfully confirmed one thing: I am really bad at pacing. But I also walked away with a wealth of tips and tricks from Coach Dennis that you just can't get from watching videos.</p>\r\n</section>\r\n<section>\r\n<h4>Step 2: Taming the Pacing Monster</h4>\r\n<p>The simulation proved my pacing was terrible. My solution? Go back to basics and bring back the heart rate monitor. I’d ditched it years ago, feeling I relied on it too much, but the data doesn't lie. However, using HR as a simple gauge isn't the whole story. Back in 2004, during my Ironman training, I did lactate testing which revealed my running aerobic threshold was 160 bpm, while my cycling threshold was a much lower 135 bpm. Redline has 12 different stations—does that mean I have 12 different HR thresholds to manage? It's a complex puzzle.</p>\r\n<p>My RPE (Rate of Perceived Exertion) also told a story. While the '24 data didn't flag my Farmer's Carry as a major weakness, I remember that's the point my RPE started to skyrocket. This year, my goal was to manage that feeling and prevent the crash.</p>\r\n</section>\r\n<section>\r\n<h4>Step 3: The Unforeseen Hurdle - A Calf Strain</h4>\r\n<p>Of course, no training plan is perfect. About three months before race day, I strained my right calf. While I could still do basic strength training, it meant my main form of cardio—running—was completely off the table. The race requires about 1.5km of running in total, a distance I hadn't covered in a single session for the entire 3-month lead-up. This was a significant mental and physical hurdle to overcome.</p>\r\n</section>\r\n<section>\r\n<h4>The '25 Game Plan: A Strategy Based on Variability</h4>\r\n<p>With all this in mind, I developed a specific pacing strategy based not just on how I felt, but on the data from last year. The key was to focus my effort on stations with high variability—where the time gap between the fastest and slowest athletes is huge. The return on effort for being in the top 5% on the Run is relatively small compared to being in the top 5% on a separator station like the Sled.</p>\r\n<figure class=\"figure text-center my-4\">\r\n<img src=\"/blog/image/my-redline-25-redemption-plan-from-data-debrief-to-race-day-strategy-part-1/thumb_Figure2.png\" class=\"figure-img img-fluid rounded\" alt=\"Chart showing station time distributions and variability from 2024\">\r\n<figcaption class=\"figure-caption text-center\">Figure 2: Stations with high variability (like the Sled) offer more opportunity to gain time than low variability stations (like the Run).</figcaption>\r\n</figure>\r\n<p>Here was my RPE-based plan going into the race:</p>\r\n<ul>\r\n<li><strong>Run:</strong> Somewhat Hard (7/10)</li>\r\n<li><strong>Ski:</strong> Somewhat Hard (7/10)</li>\r\n<li><strong>DB Burpee:</strong> Somewhat Hard (7/10)</li>\r\n<li><strong>Bike:</strong> Somewhat Hard (7/10)</li>\r\n<li><strong>Farmer's Carry:</strong> Somewhat Harder (7.5/10)</li>\r\n<li><strong>Shuttle Run:</strong> Somewhat Hard (7/10) - *watch HR*</li>\r\n<li><strong>Russian Twists:</strong> Somewhat Hard (7/10)</li>\r\n<li><strong>Sandbag Gauntlet:</strong> Hard (8/10) - *watch HR*</li>\r\n<li><strong>Row:</strong> Somewhat Hard (7/10)</li>\r\n<li><strong>Squat Thrusts:</strong> Really Hard (9/10)</li>\r\n<li><strong>Mule:</strong> Somewhat Hard (7/10)</li>\r\n<li><strong>Sled Push Pull:</strong> Maximal (10/10)</li>\r\n</ul>\r\n<p>To keep my pacing in check, I watched countless negative-split videos on YouTube and adopted a simple mantra for race day: <strong>\"One minute too fast in the first half costs four minutes in the second half.\"</strong></p>\r\n</section>\r\n<section>\r\n<h4>The Goal</h4>\r\n<p>As I wrote back in June: \"Do I have a target for this Men's Singles Level 3 (Advanced) race? In '24 I just about squeezed into the Top 50% percentile. My goal for '25 is to make it into the Top 40% percentile. Based on '24 stations that would require just over a 2-minute improvement. In advance of the '25 race, its difficult to predict. And of course, I still hope that all the other 50+ oldies don't turn up. Haha!”</p>\r\n<p>The plan was set. The strategy was clear. The only thing left was to execute.</p>\r\n<p><strong>Check out Part 2 to see how the race itself went and whether the plan survived contact with reality!</strong></p>\r\n</section>",
    "images": [
        {
            "filename": "Figure1.png",
            "caption": "",
            "show_in_gallery": false
        },
        {
            "filename": "Figure2.png",
            "caption": "",
            "show_in_gallery": false
        }
    ],
    "created_at": "2025-08-04T10:14:11.414112",
    "updated_at": "2025-08-06T05:18:56.689050",
    "published_at": "2025-08-04T10:14:38.145728",
    "is_featured": true,
    "is_published": true,
    "view_count": 6,
    "slug": "my-redline-25-redemption-plan-from-data-debrief-to-race-day-strategy-part-1"
}