{
    "headline": "My Redline '25 Race Day: How the Plan Survived Reality (Part 2)",
    "text": "<section>\r\n<p>In <a href=\"/blog/my-redline-25-redemption-plan-from-data-debrief-to-race-day-strategy-part-1\">Part 1 of this series</a>, I laid out my entire data-driven strategy for tackling the '25 Redline Fitness Games. I had a pacing plan based on Rate of Perceived Exertion (RPE), a focus on high-variability stations, and a mantra to keep me from blowing up early: <em>\"One minute too fast in the first half costs four minutes in the second half.\"</em></p>\r\n<p>But as any competitor knows, a plan is just a theory until the buzzer goes off. So, how did it all hold up in the heat of battle? I checked my laces were good and tight, started my heart rate monitor, and then... we were off.</p>\r\n</section>\r\n<section>\r\n<h4>The Station-by-Station Debrief</h4>\r\n<p>Here’s a breakdown of how each station felt versus the plan:</p>\r\n<ul>\r\n<li><strong>Run:</strong> Took it relatively easy to prevent my HR from rocketing. Mission accomplished.</li>\r\n<li><strong>Ski:</strong> Again, stuck to the mantra and kept the resistance at a manageable 5. No heroics here.</li>\r\n<li><strong>DB Burpee:</strong> A rocky start with my first rep being a no-rep on the Deadball, but after that, it was smooth sailing. No repeat of the '24 disaster!</li>\r\n<li><strong>Bike:</strong> I stuck with Resistance 5, but my pace started to drift up. I had to consciously remind myself to pull back and stick to the plan.</li>\r\n<li><strong>Farmer's Carry:</strong> I used liquid chalk for the first time, and it worked like an absolute charm. I didn’t have to put the kettlebells down once—a huge confidence booster.</li>\r\n<li><strong>Shuttle Run:</strong> This is where I felt my HR continuously drifting up. I slowed my pace as much as I could to keep it under control.</li>\r\n<li><strong>Russian Twists:</strong> I had pre-determined this was a low-priority station. I kept it steady, taking four quick breaks in the middle of the 100 reps to manage fatigue.</li>\r\n<li><strong>Sandbag Gauntlet:</strong> This was the first major battle with my heart rate. It felt like it was sitting in the low 160s, and I was actively trying to lower it. Looking at my watch data afterwards, it actually maxed out at 171 bpm here.</li>\r\n<li><strong>Row:</strong> Back to Resistance 5. The goal was to stay steady and get my HR down before the dreaded Squat Thrusts, but it was still hovering in the 160s at the end.</li>\r\n<li><strong>Squat Thrusts:</strong> I felt like I was going to die. My breathing technique went out the toilet. I strategically broke it up into short bursts right from the beginning to survive.</li>\r\nmule\r\n<li><strong>The Mule:</strong> Just kept a steady pace here, focusing on moving forward. I was breathless coming out of it.</li>\r\n<li><strong>Sled Push & Pull:</strong> I got a 'good' lane and only had to stop once during the push and once during the pull. As instructed by the judges due to a backlog, I only did one 'lap' and received the 3-minute equalization penalty. To be honest, it felt about right.</li>\r\n</ul>\r\n</section>\r\n<section>\r\n<h4>The Heart of the Race: A Look at the HR Data</h4>\r\n<p>My heart rate data tells the story of the race. Despite a few moments where the monitor spiked low due to an equipment issue, you can see the clear strategy at play. In the first three-quarters of the race, there are visible dips where I consciously tried to slow down and recover on the lower-priority stations. The goal was to keep stress to a minimum on low-variability stations and save energy for the back half.</p>\r\n<figure class=\"figure text-center my-4\">\r\n<img src=\"/blog/image/my-redline-25-race-day-how-the-plan-survived-reality-part-2/thumb_Figure3.png\" class=\"figure-img img-fluid rounded\" alt=\"My Heart Rate Trace from Redline '25\">\r\n<figcaption class=\"figure-caption text-center\">Figure 1: My HR data shows a conscious effort to manage my heart rate on lower priority stations to conserve energy for the end.</figcaption>\r\n</figure>\r\n</section>\r\n<section>\r\n<h4>The Strategy Paid Off: Where it Mattered</h4>\r\n<p>One of the biggest improvements from last year was my transitions. I moved quickly and steadily between every station. There was no hanging around, no wasted seconds. This was free time gained.</p>\r\n<p>When I look at my performance breakdown, it’s clear the plan worked. The stations where I performed relatively \"worst\" (Run, Russian Twists, Ski, and The Mule) were the exact low-variability stations I had planned to take easier. I sacrificed time where it mattered least to gain time where it mattered most.</p>\r\n<figure class=\"figure text-center my-4\">\r\n<img src=\"/blog/image/my-redline-25-race-day-how-the-plan-survived-reality-part-2/thumb_Figure4.png\" class=\"figure-img img-fluid rounded\" alt=\"My 2025 Performance vs. Time Percentiles\">\r\n<figcaption class=\"figure-caption text-center\">Figure 2: I performed relatively worse on low variability stations (highlighted in yellow boxes), which was exactly the plan.</figcaption>\r\n</figure>\r\n</section>\r\n<section>\r\n<h4>The Final Verdict: Goal Annihilated!</h4>\r\n<p>So, how did I do against my goal? To recap, I wrote: <em>\"My goal for '25 is to make it into the Top 40% percentile.\"</em></p>\r\n<p>The final result? **Top 16%!** I was absolutely thrilled. My finishing time of 42:14 put me well ahead of where I thought I'd be.</p>\r\n<figure class=\"figure text-center my-4\">\r\n<img src=\"/blog/image/my-redline-25-race-day-how-the-plan-survived-reality-part-2/thumb_Figure5.png\" class=\"figure-img img-fluid rounded\" alt=\"My Overall Finish Time Distribution for Men's Singles Advanced '25\">\r\n<figcaption class=\"figure-caption text-center\">Figure 3: My final position landed me in the Top 16% of a competitive field.</figcaption>\r\n</figure>\r\n<p>And for the icing on the cake? I managed to secure **first place in the Male 50+ age category!** Out of 10 tough competitors in my group, I came out on top. It's a huge improvement from last year's 4th-place finish out of 8, and a testament to the power of a data-driven strategy and smarter training.</p>\r\n<p>Thanks for following my journey. Now, the planning for 2026 begins!</p>\r\n</section>",
    "images": [
        {
            "filename": "Figure4.png",
            "caption": "",
            "show_in_gallery": false
        },
        {
            "filename": "Figure5.png",
            "caption": "",
            "show_in_gallery": false
        },
        {
            "filename": "Figure6.png",
            "caption": "Snaps from race day!",
            "show_in_gallery": true
        },
        {
            "filename": "Figure3.png",
            "caption": "",
            "show_in_gallery": false
        }
    ],
    "created_at": "2025-08-04T10:15:32.539015",
    "updated_at": "2025-08-06T05:15:43.448768",
    "published_at": "2025-08-04T10:15:32.539015",
    "is_featured": true,
    "is_published": true,
    "view_count": 17,
    "slug": "my-redline-25-race-day-how-the-plan-survived-reality-part-2"
}