{
    "headline": "My Redline '24 Journey: Sweat, Stats, and a Strategy for '25",
    "text": "<section>\r\n        <h2>The Spark: A Hybrid-Curious Athlete Dips His Toes In</h2>\r\n        <p>Time to share my own Redline journey! I'd call myself 'hybrid-curious' when I first saw the promos for the Redline Fitness Games '24 on Instagram. I hadn't really accumulated any significant 'hybrid' training experience. Sure, I partook in one compulsory Viper Challenge years ago, and I guess triathlon would be the closest thing to any serious hybrid racing I'd done, but that was way back in the mid-noughties!</p>\r\n        <p>My training leading up to the event consisted of bootcamp (mostly) twice a week with <a href=\"https://www.instagram.com/cosmicfitclubmy/\" target=\"_blank\">@cosmicfitclubmy</a> and rather unstructured dumbbell or running workouts at home. Not having regular access to a fully equipped gym made simulating some of the Redline-specific challenges tough. I did manage to attend 3 or 4 prep classes with the fantastic crew at <a href=\"https://www.instagram.com/ironbrigade.functionalstudio/\" target=\"_blank\">@ironbrigade.functionalstudio</a>, but in hindsight, it wasn't quite enough to truly dial in for all the stations. While I felt relatively well-prepared physically, I wasn't quite ready for the specific demands of every challenge. I never got the chance to properly train with an 18kg deadball, 20kg sandbags, the battle ropes, or that scary sled.</p>\r\n    </section>\r\n\r\n    <section>\r\n        <h2>Race Day: Hopes, Hurdles, and Heart Rate</h2>\r\n        <p>Given I fall into the 50+ age bracket, I decided to enter the Men's Advanced (Competitive) category. My thinking? If not many 'oldies' turned up, I might just snag a decent spot in my age category! On race day, I arrived early, soaking up the atmosphere and watching other competitors tackle the stations, trying to mentally prepare.</p>\r\n        <p>Things started reasonably well... until the Deadball Burpees Over Target. The burpees themselves were manageable, but that deadball! It just seemed to have a personal vendetta against clearing the target. After what felt like an eternity (and probably was, as the data later showed!), I finally moved on. The subsequent stations felt relatively okay until the Farmer's Carry. Here, I made a rookie mistake: wearing gloves. I didn't have a heart rate monitor on, but from that point onwards, it felt like my HR flatlined, and every station became a battle. I remember the Ski Erg being particularly tough, and the Sled Push Pull at the end felt nearly impossible. But, I gritted my teeth and got to the finish line!</p>\r\n        \r\n        <figure class=\"figure text-center my-4\">\r\n            <img src=\"/blog/image/my-redline-24-journey-sweat-stats-and-a-strategy-for-25/thumb_menssinglescompetitive2024_stephen-anthony-cleary_Bar_Distribution_markup.png\" class=\"figure-img img-fluid rounded\" alt=\"My Performance vs. Athlete Percentiles\">\r\n            <figcaption class=\"figure-caption text-center\">Figure 1: My station times (marker) against the general field's performance bands. The Deadball Burpees and Sled Push Pull clearly stand out.</figcaption>\r\n        </figure>\r\n    </section>\r\n\r\n    <section>\r\n        <h2>The Data Scientist Emerges: What Did the Numbers Say?</h2>\r\n        <p>Around the time I entered the '24 race, I was finishing up an online data science course and was itching for a real-world project to apply my new skills. Redline Results became that project! So, let's see what my own data revealed.</p>\r\n        <p>This Violin Chart below is a more 'mathematically' precise way of visualizing the distribution of times for each station compared to the stacked bars above. It shows where the bulk of athletes' times fell (the wider parts of the 'violin') and where outliers (like some of mine!) sit. If you look closely and long enough at the graph, you might start to see an angry bird or two.</p>\r\n\r\n        <figure class=\"figure text-center my-4\">\r\n            <img src=\"/blog/image/my-redline-24-journey-sweat-stats-and-a-strategy-for-25/thumb_menssinglescompetitive2024_stephen-anthony-cleary_Violin_markup.png\" class=\"figure-img img-fluid rounded\" alt=\"My Station Times vs. Distribution\">\r\n            <figcaption class=\"figure-caption text-center\">Figure 2: My times (diamond markers) compared to the overall distribution for each station.</figcaption>\r\n        </figure>\r\n\r\n        <p>It wasn't all doom and gloom! The data (and how I felt) confirmed I performed relatively well on the Bike Erg. But looking back, perhaps I pushed a bit *too* hard there, leaving less in the tank for what followed. Pacing is key!</p>\r\n        \r\n        <!-- Placeholder for YOUR PERSONAL Radar Chart -->\r\n        <figure class=\"figure text-center my-4\">\r\n            <img src=\"/blog/image/my-redline-24-journey-sweat-stats-and-a-strategy-for-25/thumb_menssinglescompetitive2024_stephen-anthony-cleary_Radar_Percentile_markup.png\" class=\"figure-img img-fluid rounded\" alt=\"My Performance Rank Percentile Radar\">\r\n            <figcaption class=\"figure-caption text-center\">Figure 3: My rank percentile radar. Points further from the center indicate a better rank percentile relative to the field.</figcaption>\r\n        </figure>\r\n    </section>\r\n\r\n    <section>\r\n        <h2>The Most Revealing Chart: Me vs. My Peers</h2>\r\n        <p>For me, this next chart (the Station Time Difference chart) was the most informative. It’s created by focusing only on athletes who finished within +/- 5% of my own net time, and then it compares my individual station times to the average of that specific peer group. It starkly shows where I gained or lost time against those who finished around me.</p>\r\n\r\n        <!-- Placeholder for YOUR PERSONAL Station Time Difference Chart -->\r\n        <figure class=\"figure text-center my-4\">\r\n            <img src=\"/blog/image/my-redline-24-journey-sweat-stats-and-a-strategy-for-25/thumb_menssinglescompetitive2024_stephen-anthony-cleary_DiffSim_markup.png\" class=\"figure-img img-fluid rounded\" alt=\"My Station Time Difference vs. Similar Finishers\">\r\n            <figcaption class=\"figure-caption text-center\">Figure 4: Time gained (green) or lost (red) per station compared to similar finishers.</figcaption>\r\n        </figure>\r\n\r\n        <p>Obviously, the Deadball Burpees and the Sled Push Pull show up as significant red bars, meaning I lost a lot of time there compared to my peers. What's also plain to see is a trend: I get progressively worse, relatively speaking, as the race goes on. This strongly suggests either a general fitness deficit for this type of event or, more likely, a suboptimal pacing strategy. It's quite possible those Deadball Burpees just took too much out of me too early.</p>\r\n    </section>\r\n    \r\n    <section>\r\n        <h2>The Silver Lining and Final Standings</h2>\r\n\r\n        <figure class=\"figure text-center my-4\">\r\n            <img src=\"/blog/image/my-redline-24-journey-sweat-stats-and-a-strategy-for-25/thumb_StephenCleary50Category.png\" class=\"figure-img img-fluid rounded\" alt=\"My Station Time Difference vs. Similar Finishers\">\r\n            <figcaption class=\"figure-caption text-center\">Figure 5: 50+ Category Placings</figcaption>\r\n        </figure>\r\n        <p>Despite the struggles, there was a silver lining! In the 50+ category for the Men's Singles Competitive, only 8 athletes took part, and I managed to secure the #4 slot. It was a close-run thing, though – #5 was only 10 seconds behind me, and #6, if you exclude his Time Adjustment penalty, was just 1 second behind! Every second truly counts.</p>\r\n    </section>\r\n\r\n    <section>\r\n        <h2>Conclusion: Strategy for Redline '25</h2>\r\n        <p>So, how am I approaching Redline '25? I've entered the same event again. Ideally, my training should be laser-focused on improving my Deadball Burpee capacity, building serious strength for the Sled, and working on overall fitness and pacing to prevent that latter-half fade. Unfortunately, a slight calf strain is currently hampering my running/aerobic training, but I'm looking forward to getting back out there and applying these data-driven lessons. I'm also lacking in getting back to some of the actual race day equipment</p>\r\n        <p>Do I have a target for this Men's Singles Level 3 (Advanced) race. In '24 I just about squeezed into the Top 50% percentile. My goal for '25 is to make it into the Top 40% percentile. Based on '24 stations that would require just over a 2 minute improvement. In advance of the '25 race, its difficult to predict. And of course, I still hope that all the other 50+ oldies don't turn up. Haha!</p>\r\n        <figure class=\"figure text-center my-4\">\r\n            <img src=\"/blog/image/my-redline-24-journey-sweat-stats-and-a-strategy-for-25/thumb_StephenClearyPacing.png\" class=\"figure-img img-fluid rounded\" alt=\"'25 target based on '24 pacing\">\r\n            <figcaption class=\"figure-caption text-center\">Figure 6: '24 Pacing Target for '25</figcaption>\r\n        </figure>\r\n        <p>My journey with Redline and data analysis has just begun. If you're curious about your own performance, I encourage you to explore your results and see what insights you can uncover!</p>\r\n        <p>Take Care,<br>Steve.</p>\r\n    </section></article>",
    "images": [
        {
            "filename": "menssinglescompetitive2024_stephen-anthony-cleary_DiffSim_markup.png",
            "caption": "",
            "show_in_gallery": false
        },
        {
            "filename": "StephenCleary50Category.png",
            "caption": "",
            "show_in_gallery": false
        },
        {
            "filename": "menssinglescompetitive2024_stephen-anthony-cleary_Bar_Distribution_markup.png",
            "caption": "",
            "show_in_gallery": false
        },
        {
            "filename": "menssinglescompetitive2024_stephen-anthony-cleary_Radar_Percentile_markup.png",
            "caption": "",
            "show_in_gallery": false
        },
        {
            "filename": "menssinglescompetitive2024_stephen-anthony-cleary_Violin_markup.png",
            "caption": "",
            "show_in_gallery": false
        },
        {
            "filename": "StephenClearyPacing.png",
            "caption": "",
            "show_in_gallery": false
        }
    ],
    "created_at": "2025-06-09T16:28:10.472868",
    "updated_at": "2025-08-01T13:37:33.314979",
    "published_at": "2025-06-09T16:50:16.210476",
    "is_featured": true,
    "is_published": true,
    "view_count": 38,
    "slug": "my-redline-24-journey-sweat-stats-and-a-strategy-for-25"
}